2#. Написать программу получающую набор произведений чисел от 1 до N.
# n = int(input('input N: '))
# factorial = 1
# for i in range(1, n+1):
# factorial *= i
# print(factorial, end=' ')